qinyunti/py32f403-nes/proj/PY32F403_HAL_Driver/Inc/py32f403_ll_pwr.h
/**
  ******************************************************************************
  * @file    py32f403_ll_pwr.h
  * @author  MCU Application Team
  * @brief   Header file of PWR LL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef PY32F403_LL_PWR_H
#define PY32F403_LL_PWR_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32f4xx.h"

/** @addtogroup PY32F403_LL_Driver
  * @{
  */

#if defined(PWR)

/** @defgroup PWR_LL PWR
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup PWR_LL_Exported_Constants PWR Exported Constants
  * @{
  */

/** @defgroup PWR_LL_EC_REGU_VOLTAGE REGU VOLTAGE
  * @{
  */
#define LL_PWR_REGU_VOLTAGE_SCALE1         0x00000000U                     /* After entering stop mode, VDD=1.1V */
#define LL_PWR_REGU_VOLTAGE_SCALE2         (PWR_CR_VOS_0)                  /* After entering stop mode, VDD=1.0V */
#define LL_PWR_REGU_VOLTAGE_SCALE3         (PWR_CR_VOS_1)                  /* After entering stop mode, VDD=0.9V */
#define LL_PWR_REGU_VOLTAGE_SCALE4         (PWR_CR_VOS_1 | PWR_CR_VOS_0)   /* After entering stop mode, VDD=0.8V */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_REGU_VOLTAGE REGU VOLTAGE
  * @{
  */
#define LL_PWR_REGU_VOLTAGE_1P1V           LL_PWR_REGU_VOLTAGE_SCALE1        /* After entering stop mode, VDD=1.1V */
#define LL_PWR_REGU_VOLTAGE_1P0V           LL_PWR_REGU_VOLTAGE_SCALE2        /* After entering stop mode, VDD=1.0V */
#define LL_PWR_REGU_VOLTAGE_0P9V           LL_PWR_REGU_VOLTAGE_SCALE3        /* After entering stop mode, VDD=0.9V */
#define LL_PWR_REGU_VOLTAGE_0P8V           LL_PWR_REGU_VOLTAGE_SCALE4        /* After entering stop mode, VDD=0.8V */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_BACKUP_VOLTAGE BACKUP VOLTAGE
  * @{
  */
#define LL_PWR_BACKUP_VOLTAGE_1P1V           (0x00000000)                                     /* VDDK=1.1V */
#define LL_PWR_BACKUP_VOLTAGE_0P9V           (PWR_CR_BKPVR_VOS_0)                             /* VDDK=0.9V */
#define LL_PWR_BACKUP_VOLTAGE_0P85V          (PWR_CR_BKPVR_VOS_1)                             /* VDDK=0.85V */
#define LL_PWR_BACKUP_VOLTAGE_0P8V           (PWR_CR_BKPVR_VOS_1 | PWR_CR_BKPVR_VOS_0)        /* VDDK=0.8V */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_WAKEUP_HSION_MODE WAKEUP HSI ON MODE
  * @{
  */
#define LL_PWR_STOPWAKEUP_HSION_AFTER_MR       0x00000000U        /* Wake up from the STOP mode, After the MR becomes stable, enable HSI */
#define LL_PWR_STOPWAKEUP_HSION_IMMEDIATE      PWR_CR_HSION_CTRL  /* Wake up from the STOP mode, Enable HSI immediately */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_WAKEUP_FLASH_DELAY WAKEUP FLASH DELAY
  * @{
  */          
#define LL_PWR_STOPWAKEUP_FLASH_DELAY_3US      (0x00000000U)                             /* Wake up from the STOP mode, Delay 3us enable flash*/
#define LL_PWR_STOPWAKEUP_FLASH_DELAY_5US      (                    PWR_CR_FLS_WUPT_0)   /* Wake up from the STOP mode, Delay 5us enable flash*/
#define LL_PWR_STOPWAKEUP_FLASH_DELAY_2US      (PWR_CR_FLS_WUPT_1                    )   /* Wake up from the STOP mode, Delay 2us enable flash*/
#define LL_PWR_STOPWAKEUP_FLASH_DELAY_0US      (PWR_CR_FLS_WUPT_1 | PWR_CR_FLS_WUPT_0)   /* Wake up from the STOP mode, Delay 0us enable flash*/
/**
  * @}
  */


/** @defgroup PWR_LL_EC_WAKEUP_FLASH_DELAY WAKEUP FLASH DELAY
  * @{
  */          
#define LL_PWR_STANDBYWAKEUP_MRREADY_DELAY_5US      (0x00000000U)                                           /* Wake up from the STANDBY mode, MR ready wait 5us*/
#define LL_PWR_STANDBYWAKEUP_MRREADY_DELAY_10US     (                            PWR_CR_STDBY_MRRDY_WAIT_0) /* Wake up from the STANDBY mode, MR ready wait 10us*/
#define LL_PWR_STANDBYWAKEUP_MRREADY_DELAY_20US     (PWR_CR_STDBY_MRRDY_WAIT_1                            ) /* Wake up from the STANDBY mode, MR ready wait 20us*/
#define LL_PWR_STANDBYWAKEUP_MRREADY_DELAY_30US     (PWR_CR_STDBY_MRRDY_WAIT_1 | PWR_CR_STDBY_MRRDY_WAIT_0) /* Wake up from the STANDBY mode, MR ready wait 30us*/
/**
  * @}
  */

/** @defgroup PWR_LL_EC_CLEAR_FLAG Clear Flags Defines
  * @brief    Flags defines which can be used with LL_PWR_WriteReg function
  * @{
  */
#define LL_PWR_CR_CSBF                     PWR_CR_CSBF            /*!< Clear standby flag */
#define LL_PWR_CR_CWUF                     PWR_CR_CWUF            /*!< Clear wakeup flag */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with LL_PWR_ReadReg function
  * @{
  */
#define LL_PWR_CSR_WUF                     PWR_CSR_WUF            /*!< Wakeup flag */
#define LL_PWR_CSR_SBF                     PWR_CSR_SBF            /*!< Standby flag */
#define LL_PWR_CSR_PVDO                    PWR_CSR_PVDO           /*!< Power voltage detector output flag */
#define LL_PWR_CSR_EWUP1                   PWR_CSR_EWUP1          /*!< Enable WKUP pin 1 */
#define LL_PWR_CSR_EWUP2                   PWR_CSR_EWUP2          /*!< Enable WKUP pin 2 */
#define LL_PWR_CSR_EWUP3                   PWR_CSR_EWUP3          /*!< Enable WKUP pin 3 */
#define LL_PWR_CSR_EWUP4                   PWR_CSR_EWUP4          /*!< Enable WKUP pin 4 */
#define LL_PWR_CSR_EWUP5                   PWR_CSR_EWUP5          /*!< Enable WKUP pin 5 */
/**
  * @}
  */


